using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Lab1oop
{
    internal class ShowInfo
    {
        public  void ShowHowToUse()
        {
            MessageBox.Show("На таблиці виберається клітинка," +
                "\nв текстове поле вводитья вираз.");
            MessageBox.Show("Значення виразу виводиться в обрану клітинку." +
                "\nПри помилці виводится \"Error\" або \"#CIRCLE\".");
            MessageBox.Show("Значення клітинок базово 0." +
                "\nКлітинки з помилкою теж мають значення 0.");
            MessageBox.Show("Для додання/видалення рядка/стовпчика" +
                "\nнатискається відповідна кнопка." +
                "\nКількість рядків: 2-10." +
                "\nКількість стовпчиків: 2-26.");
            MessageBox.Show("Для завантаження файлу або збереження файлу" +
                "\nвикористовується \".txt\"." +
                "\nУ файлі окремі значення клітинок " +
                "\nу одному рядку відділені \"/\"," +
                "\npядки записуються в окремі рядки.");
            MessageBox.Show("Для посилання на іншу клітинку" +
                "\nу виразі записується спочатку значення стовпчика," +
                "\nпотім значення рядка;" +
                "\nприклад - \"А0\".");
            MessageBox.Show("Доступні функції додавання(+), віднімання(-)," +
                "\nмноження(*), ділення(/), залишку від ділення(%),цылочисельного дылення(|)," +
                "\nпіднесення до степеню(^), функцій мінімум та максимум, використання дужок");
            MessageBox.Show("Мінімум та максимум приймають в дужках типу \"{}\"," +
                "\nчерез кому, декілька значень або посилань на клітинку," +
                "\nі повертають їх найменше або найбільше з них");
        }

        public void ShowAbout()
        {
            MessageBox.Show("Лабораторна робота 1" +
                "\nВаріант 7" +
                "\nГрупа К-27" +
                "\nСорокін Костянтин Денисович");
        }
    }
}
